## Staging: alarms
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 3 to add, 0 to change, 3 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                               NAME                               |
|----------|------------------------------------------------------------------|
| recreate | `aws_cloudwatch_metric_alarm.api_lb_healthy_host_count`          |
|          | `aws_cloudwatch_metric_alarm.idb_lb_healthy_host_count[&quot;HTTP1&quot;]` |
|          | `aws_cloudwatch_metric_alarm.idb_lb_healthy_host_count[&quot;HTTP2&quot;]` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_cloudwatch_metric_alarm.api_lb_healthy_host_count must be replaced
-/+ resource "aws_cloudwatch_metric_alarm" "api_lb_healthy_host_count" {
      ~ alarm_name                            = "API-HealthyHostCount" -> "API-HealthyHostCount-SEV1" # forces replacement
      ~ arn                                   = "arn:aws:cloudwatch:ca-central-1:687401027353:alarm:API-HealthyHostCount" -> (known after apply)
      - datapoints_to_alarm                   = 0 -> null
      + evaluate_low_sample_count_percentiles = (known after apply)
      ~ id                                    = "API-HealthyHostCount" -> (known after apply)
      - insufficient_data_actions             = [] -> null
      - ok_actions                            = [] -> null
      - tags                                  = {} -> null
        # (16 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.idb_lb_healthy_host_count["HTTP1"] must be replaced
-/+ resource "aws_cloudwatch_metric_alarm" "idb_lb_healthy_host_count" {
      ~ alarm_name                            = "IdP-HealthyHostCount-HTTP1" -> "IdP-HealthyHostCount-HTTP1-SEV1" # forces replacement
      ~ arn                                   = "arn:aws:cloudwatch:ca-central-1:687401027353:alarm:IdP-HealthyHostCount-HTTP1" -> (known after apply)
      - datapoints_to_alarm                   = 0 -> null
      + evaluate_low_sample_count_percentiles = (known after apply)
      ~ id                                    = "IdP-HealthyHostCount-HTTP1" -> (known after apply)
      - insufficient_data_actions             = [] -> null
      - ok_actions                            = [] -> null
      - tags                                  = {} -> null
        # (16 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.idb_lb_healthy_host_count["HTTP2"] must be replaced
-/+ resource "aws_cloudwatch_metric_alarm" "idb_lb_healthy_host_count" {
      ~ alarm_name                            = "IdP-HealthyHostCount-HTTP2" -> "IdP-HealthyHostCount-HTTP2-SEV1" # forces replacement
      ~ arn                                   = "arn:aws:cloudwatch:ca-central-1:687401027353:alarm:IdP-HealthyHostCount-HTTP2" -> (known after apply)
      - datapoints_to_alarm                   = 0 -> null
      + evaluate_low_sample_count_percentiles = (known after apply)
      ~ id                                    = "IdP-HealthyHostCount-HTTP2" -> (known after apply)
      - insufficient_data_actions             = [] -> null
      - ok_actions                            = [] -> null
      - tags                                  = {} -> null
        # (16 unchanged attributes hidden)
    }

Plan: 3 to add, 0 to change, 3 to destroy.

Warning: Argument is deprecated

  with module.athena_bucket.aws_s3_bucket.this,
  on .terraform/modules/athena_bucket/S3/main.tf line 8, in resource "aws_s3_bucket" "this":
   8: resource "aws_s3_bucket" "this" {

Use the aws_s3_bucket_lifecycle_configuration resource instead

(and 3 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_athena_data_catalog.dynamodb"]
WARN - plan.json - main - Missing Common Tags: ["aws_athena_data_catalog.rds_data_catalog"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.codedeploy_sns"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notify_slack"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.ELB_5xx_error_warn"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.ELB_healthy_hosts"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.alb_ddos"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.api_audit_log_dead_letter_queue_warn"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.api_cpu_utilization_high_warn"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.api_lb_healthy_host_count"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.api_lb_unhealthy_host_count"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.api_memory_utilization_high_warn"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.api_response_time_warn"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.audit_log_dead_letter_queue_warn"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.cognito_signin_exceeded"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.ddos_detected_forms_warn"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.ddos_detected_route53_warn[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.forms_cpu_utilization_high_warn"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.forms_memory_utilization_high_warn"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
